[
  {
    "work_order": "1184228",
    "activity_id": "1115985",
    "make": "Toyota",
    "vehicle_model": "Tundra TRD Rally",
    "contact": "David Undercoffler",
    "media_outlet": "Autolist.com",
    "office": "Los Angeles",
    "clip_url": "https://www.autolist.com/toyota-tundra/2025-toyota-tundra-review",
    "original_links": "https://www.autolist.com/guides",
    "article_published_date": "2025-06-12T00:00:00",
    "loan_end_date": "05-08-25",
    "processed_date": "2025-06-27T20:30:37.309971",
    "relevance_score": "8",
    "overall_score": "8",
    "sentiment": "neutral",
    "overall_sentiment": "positive",
    "summary": "The article provides a comprehensive review of the 2025 Toyota Tundra, emphasizing its performance, safety, and design. While it praises the truck's capabilities and safety features, it also points out areas where the Tundra falls short compared to its competitors, such as fuel economy and towing capacity.",
    "brand_alignment": "True",
    "recommendation": "The review is generally positive and suggests the Tundra is a worthy consideration for potential buyers, especially those valuing safety and performance.",
    "key_mentions": "['i-FORCE and i-FORCE MAX powertrains provide robust performance', 'Toyota Safety Sense 2.5 suite offers comprehensive safety features', 'High resale value makes it a good long-term investment']",
    "performance_score": "9",
    "performance_note": "The article provides a detailed analysis of the Tundra's performance, highlighting the capabilities of its i-FORCE and i-FORCE MAX powertrains, and noting its impressive acceleration and off-road capabilities, especially in the TRD Pro model.",
    "design_score": "8",
    "design_note": "The article discusses the Tundra's exterior design, describing it as robust and fitting for a full-size truck with unique elements in the TRD Pro and TRD Off-Road Package models.",
    "interior_score": "7",
    "interior_note": "Interior comfort is adequately covered, noting available massaging front seats, power-adjustable seats, and spacious legroom, especially in the CrewMax models.",
    "technology_score": "7",
    "technology_note": "Technology and infotainment are discussed with mentions of standard and available features across different trims, including safety tech and advanced infotainment options.",
    "value_score": "7",
    "value_note": "The article evaluates the Tundra's value proposition by discussing its high resale value, pricing across different trims, and comparing it with competitors.",
    "pros": "Strong performance with both standard and hybrid powertrains | High safety ratings and comprehensive suite of safety features | Good resale value and robust exterior design",
    "cons": "Fuel economy is not leading in its class | Maximum towing and payload capacities are lower than some competitors | Interior and technology features are not the most advanced in the segment",
    "url_tracking": "[{'original_url': 'https://www.autolist.com/guides', 'success': True, 'reason': 'Best match (relevance: 8/10)', 'actual_url': 'https://www.autolist.com/toyota-tundra/2025-toyota-tundra-review', 'relevance_score': 8, 'content_type': 'web', 'processing_method': 'Web Crawler'}, {'original_url': 'https://www.cargurus.com/research', 'success': False, 'reason': 'GPT analysis failed', 'actual_url': 'https://www.cargurus.com/research', 'relevance_score': 0, 'content_type': 'web', 'processing_method': 'Web Crawler'}, {'original_url': 'https://www.forbes.com/cars-bikes/', 'success': False, 'reason': 'No content found or date filtered', 'actual_url': 'https://www.forbes.com/cars-bikes/', 'relevance_score': 0, 'content_type': 'web', 'processing_method': 'Web Crawler'}]",
    "urls_processed": "3",
    "urls_successful": "1",
    "approval_timestamp": "2025-06-28T15:30:27.377614"
  }
]